[
  {
    "image_path": "images/reviews/repair/review_1.png",
    "content": "I needed to get some cracks and columns in an old stone foundation inspected.  I called SKV construction and Stan promptly came to inspect and give an estimate that week.  Stan was very knowledgeable and knew exactly what needed to be done to correct and preserve the areas of concern.  Stan's experience was evident throughout the process and I am happy with the work completed.  Will definitely work with Stan again for any future work needed."
  },
  {
    "image_path": "images/reviews/repair/review_2.png",
    "content": "Stan does good work. I am happy with the driveway crack repairs he did. Additionally, he managed to smooth out the unleveled portions and now my driveway is back to being mostly normal. It had settling and years of use; now corrected and looking good. Since Stan does such great work, I called him again to take care of a couple foundation cracks to reinforce the foundation. I would recommend him and SKV Construction for any concrete work needs."
  },
  {
    "image_path": "images/reviews/repair/review_3.png",
    "content": "Had a corner of the houses' stone foundation come loose and needed it repaired so as to keep the house from settling.  I looked around for a company that would perform such a repair; which SKV was the only company that would touch this kind of job. Stan came out the next day to give his idea and cost.  The repair felt more like I was working with him instead of being pressured to get the job.  He did fantastic work and had it done in less than a day. Would I recommend him? By all means.  He does great work, including cleaning up the site, in a timely fashion."
  },
  {
    "image_path": "images/reviews/repair/review_4.png",
    "content": "Stan tackled a huge crack running the entire length of our garage floor slab due to a slight settling of a side foundation. He ground the edges of the crack until they were level, then filled the crack. The next work day, he ground perpendicular grooves across the repaired crack, installed barbed composite lines in the grooves, and covered them with a cement repair product to stabilize the floor. We were highly satisfied with the repair, the work and the man. A job well done.  Stan is one of those 'old fashioned' tradesman, he listens to your concerns, proposes a solution based on his over 50 years of experience, and then completes the work, on time and in a professional manner."
  },
  {
    "image_path": "images/reviews/repair/review_5.png",
    "content": "Got it touch with SKV via referral service. Got contacted immediately after requesting a quote for fixing a crack in my foundation. Got the quote on the next day. Quote was far better than the big competitors' quotes, no high pressure sales pitches. My problem was fixed on time and on budget. I liked the result very much. Hired SKV again to fix similar problems in my new house, with the same punctual, no-fuss, on-time, on-budget result. All around excellent job, would hire them again in a heartbeat."
  },
  {
    "image_path": "images/reviews/repair/review_6.png",
    "content": "I have utilized SKV Construction many times over the years. They've helped me at many residential locations as well as on several larger commercial projects. I will continue to work with SKV because they come through where it vitally important. They have the knowledge to properly assess a problem, they know the best solution and how to apply it.  Having been in business and successful for over 50 years, SKV has the integrity to provide honest, accurate information - not just a sales pitch."
  }
]