[
  {
    "image_path": "images/reviews/review_1.png",
    "content": "Nick from 3D Concrete Design was extremely helpful! I was unsure whether a patio crack needed repair on full-on replacement. Nick recommended a simple repair, explained why in plain-language and provided a fair estimate in no time. From this interaction, I can tell that the folks at 3D Concrete Design are honest brokers and stand-people. I wouldn't hesitate to do business with them again in the future :-)"
  },
  {
    "image_path": "images/reviews/review_2.png",
    "content": "Nick contacted me same day that I left a message. He agreed to take a look the next morning at 9AM, and was even early. After discussing what I wanted to accomplish, Nick offered several solutions to my problem that were alternatives to my problem at a lower cost. I appreciated his honesty and professionalism. I will use him in the future if the need arises, and definitely suggest him to friends and family members."
  },
  {
    "image_path": "images/reviews/review_3.png",
    "content": "My parents needed a new driveway and sidewalks after 40 years, theirs had sunk quite a bit.  Also, trying to sell the house it was a big eyesore.   Anthony and team did a terrific job of getting it removed and replaced in a timely manner and it looks fantastic!   We were very happy with their work and would highly recommend them.  Also, Anthony was very nice and such a pleasure to work with and I felt he went out of his way to meet my elderly parents expectations.  Thank you!"
  },
  {
    "image_path": "images/reviews/review_4.png",
    "content": "Nic and 3D Concrete Design installed our stoop and sidewalk. Nic communicated quickly throughout the process.  He and the crew showed up when he or the crew said they would, Nic explained the difference between concrete, colored concrete and stamped concrete and focused on the application as much as the price. Nic's crew worked quickly (both destruction/haul away and reconstruction) and professionally. The crew conducted their work with a level of detail and care that almost made me giddy to watch. I'm thrilled with the work that Nic and the crew completed."
  }
]