[
  {
    "image_path": "images/reviews/review_1.png",
    "content": "Very pleased with entire process of working with Mike and Dependable Concrete.  Mike listened to exactly what I wanted and was able to do that at a fair price. Dependable Concrete took care of all the permits in my village and I didn't have to do anything but hang them up and pick out the design I wanted.  Pricing was very fair. ( I had other quotes that were lower, but they didn't seem like legit companies- I also had ridiculous quotes almost 2 1/2 × as much).  Mike communicated everything he and his crew were doing. It took about three weeks to start work after I left the deposit, getting permits and all. After the permits were obtained... the job was finished in 1 week from excavation to sealing and I couldn't be happier. I wanted a stamped concrete walkway and patio and Dependable Concrete completed the job.  I left such a detailed review because I'm doing a lot of work on my property  and I have worked with a lot of contractors. I appreciate, honest hard working people.  Pictures show the before, middle and finished project."
  },
  {
    "image_path": "images/reviews/review_2.png",
    "content": "We had them replace an existing old driveway and also replace a small front sidewalk installed improperly 2 years ago by another company.  Their price was reasonable.  Mike was very accommodating with what we wanted.  We had to wait for our new garage to be built before they would install the driveway, so there was a time gap between when we signed with them and when the work could actually be done.   Mike met with me again and reviewed the project when we were at the point where they could do the work.   He was very accommodating of my concerns for work around existing landscaping, our new garage, and the front steps and brick banisters.  We came to agreements on what would have to be done by both of us to protect those areas.  We also ended up increasing the area for the front sidewalk and driveway from our original plans.  Mike gave us a price for that additional area, and it was very reasonable.  He didn't try to gouge us for that.  When they did the work, they removed the front sidewalk area by hand to make sure they didn't do any damage to the existing landscaping,  steps, or banisters.  When they did the pouring, they worked a very long day in order to get it all done in one day.  Their workers were very friendly.  As they promised, the first good weather day after the pouring, they came out and sealed all of the concrete.  The final product looks great.  When our landscaper came out to finish off the grading and sod, the first thing the owner said was, 'You really have a nice looking drive now.'"
  },
  {
    "image_path": "images/reviews/review_3.png",
    "content": "Dependable Concrete removed an existing driveway and replaced it with a new concrete driveway. They were prompt in providing a cost estimate which we felt was fair and reasonable. Once the contract was signed they were really good about  letting us know what to expect and met the time milestones exactly as promised. It has now been about a year since the driveway was poured and it looks as good today as the day they completed it. I highly recommend Dependable Concrete."
  },
  {
    "image_path": "images/reviews/review_4.png",
    "content": "As the name says 'Dependable' work done. Quick work, they tell you a time, they come, get the work done."
  },
  {
    "image_path": "images/reviews/review_5.png",
    "content": "Great job! Staff friendly and professional! Highly recommended!"
  },
  {
    "image_path": "images/reviews/review_6.png",
    "content": "very clean professional work, highly recommend them."
  }
]